## 이 자료는 데이터를 전처리하고 EDA하는 일련의 과정을 연습하는 자료입니다.

## 튜토리얼에서 알려주지 않은 방법들도 포함하고 있으니 알아 두면 좋을 것 같습니다.

# 라이브러리 임포트

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

from IPython.display import display

# 데이터 로드

In [2]:
raw_df = pd.read_csv('salary.csv')
print(raw_df)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [3]:
display(raw_df)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

# EDA (Exploratory Data Analysis)

### 데이터 첫부분만 보기

In [4]:
# 기본 5줄
display(raw_df.head())

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [5]:
display(raw_df.head(3))

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

### 데이터 프레임의 크기

In [6]:
raw_df.shape # (행수, 열수)

(10, 4)

##### 활용 예

In [7]:
row_size = raw_df.shape[0]
col_size = raw_df.shape[1]

print(row_size, col_size)

10 4

### 컬럼 별 데이터 타입 보기

In [8]:
print(raw_df.dtypes)

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

### 컬럼 별 기초 통계량

    pandas Dataframe 오브젝트의 describe() method를 호출하면 컬럼 별 기술 통계량을 확인할 수 있습니다.
    
    parameter를 아무것도 주지 않으면 numerical 컬럼만의 기술 통계량을 보여줍니다.

In [9]:
raw_df.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

    inlcude='all' parameter를 주면 category 컬럼에 대한 기술 통계량도 함께 나타납니다.
    
    ** 정확히는, category 컬럼이 아니라 object 컬럼입니다.

In [10]:
raw_df.describe(include='all')

       Country        Age        Salary Purchased
count       10   9.000000      9.000000        10
unique       3        NaN           NaN         2
top     France        NaN           NaN        No
freq         4        NaN           NaN         5
mean       NaN  38.777778  63777.777778       NaN
std        NaN   7.693793  12265.579662       NaN
min        NaN  27.000000  48000.000000       NaN
25%        NaN  35.000000  54000.000000       NaN
50%        NaN  38.000000  61000.000000       NaN
75%        NaN  44.000000  72000.000000       NaN
max        NaN  50.000000  83000.000000       NaN

### 결측값

    데이터에 결측값이 존재하는지 살펴봅니다.
    
    pandas Dataframe 오브젝트의 isna() method를 호출하면 각 값이 결측값인지 아닌지 여부를 알 수 있습니다.

In [1]:
raw_df.isna()

NameError: name 'raw_df' is not defined

    위 방법은 모든 값들을 출력하기 때문에, 크기가 큰 데이터에 적용하기에는 무리입니다.
    
    any() method는 각 컬럼 별로 True값이 적어도 하나 존재하는지 여부를 알려줍니다.
    위에서 살펴본 isna() method와 함께 쓰면 각 컬럼 별로 결측값이 존재하는지 여부를 알 수 있습니다.

In [ ]:
raw_df.isna().any()

# Age와 Salary에 결측값 존재

    결측값 처리는 나중에 데이터 전처리 파트에서 하겠습니다.

### 시각화

In [ ]:
raw_df['Age'].plot(kind='bar', title='Age')
plt.show()

raw_df['Salary'].plot(kind='bar', title='Salary')
plt.show()

raw_df['Country'].value_counts(dropna=False).plot(kind='bar', title='Country')
plt.show()

raw_df['Purchased'].value_counts(dropna=False).plot(kind='bar', title='Purchased')
plt.show()


plt.gcf().clear()

    다음과 같이, for loop을 이용할 수도 있습니다.

In [ ]:
for col_name, col in raw_df.iteritems():
    if col.dtype == np.number:
        col.plot(kind='bar', title=col_name)
#         col.plot(kind='box', title=col_name)
    else:
        col.value_counts(dropna=False).plot(kind='bar', title=col_name)

    plt.show()
    plt.gcf().clear()

# 데이터 전처리

### raw_data의 복사본 만들기

In [ ]:
cleaned_df = raw_df.copy()

## 결측값 제거

    앞서 살펴봤듯이, Age와 Salary 컬럼은 결측값을 가지고 있었습니다.
    먼저 결측값을 처리하겠습니다.
    
    결측값을 처리하는 방법중 하나는 다른 값들의 평균으로 채워 넣는 것입니다.\
    Age 컬럼의 결측값을 다른 값들의 평균으로 채우겠습니다.
    
    pandas Series 오브젝트의 mean() method를 호출하면 numerical 컬럼의 평균을 반환합니다.
    skipna 파라미터를 통해 평균 계산에 결측값 포함 여부를 정할 수 있습니다.
    기본적으로 결측값을 포함하지 않고 평균을 계산합니다.

In [ ]:
cleaned_df['Age'].mean()
# cleaned_df['Age'].mean(skipna=False)

    pandas Series 오브젝트의 fillna() method를 호출하여 결측값을 채울 수 있습니다.
    어떤 값으로 채울 지, fillna() method의 인자로 넘겨주면 됩니다.

In [ ]:
cleaned_df['Age'].fillna(cleaned_df['Age'].mean())

# print(cleaned_df['Age'].isna().any())  # True, (결측값 처리 안됨.)

    위 코드만 실행해서는 cleaned_df Age 컬럼의 결측값이 처리되지 않습니다.
    fillna() method는 결측값이 처리된 새로운 pandas Series를 반환합니다.
    따라서, 반환된 Series를 cleaned_df의 Age컬럼에 새로이 할당해야합니다.

In [ ]:
cleaned_df['Age'] = cleaned_df['Age'].fillna(cleaned_df['Age'].mean())

# print(cleaned_df['Age'].isna().any())  # False (결측값 처리 됨.)

    Salary 컬럼은 평균이 아닌 중간값으로 채워보겠습니다.

In [ ]:
cleaned_df['Salary'] = cleaned_df['Salary'].fillna(cleaned_df['Salary'].mode())

print(cleaned_df.isna().any())

### 데이터 타입 변환

    다시 한번 각 컬럼의 data type을 살펴보겠습니다.

In [ ]:
cleaned_df.dtypes

    Country는 'France', 'Spain', 'Germany' 로 이루어진 컬럼입니다.
    data type이 object로 되어 있지만 category로 바꾸어 주는 것이 좋겠습니다.
    
    pandas에서 csv 파일을 읽어 Dataframe을 만들 때, Country처럼 string으로 이루어진 컬럼을 자동으로 category로 읽어 들이지 않습니다.

**1. Country의 data type을 category로 변경하기.**

    Pandas Series 오브젝트의 astype() method는 타입을 변환한 새로운 Series를 반환합니다.
    
    ** astype() method를 호출한 것만으로는 cleaned_df의 Country 컬럼에 타입 변환이 적용되지 않습니다.

In [ ]:
cleaned_df['Country'].astype('category')

    astype() method가 반환한 타입 변환된 Series를 cleaned_df['Country']에 할당합니다.

In [ ]:
cleaned_df['Country'] = cleaned_df['Country'].astype('category')

# print(cleaned_df['Country'].dtype)
# print(cleaned_df.dtypes)

**2. Age의 data type을 int64로 변경하기**

    astype() method를 이용하여 cleaned_df의 Age 컬럼을 np.int64 타입으로 변환
    
    np.int64: np는 numpy를 import할 때 적용한 alias(별칭)이고, int64는 numpy에서 활용하는 integer자료형 중 하나 (64bit integer 자료형)

In [ ]:
cleaned_df['Age'] = cleaned_df['Age'].astype(np.int64)

     만일 타입 변환을 하기 전에 결측값 제거를 하지 않았다면, ValueError가 발생할 수도 있습니다.
     
     결측값제거가 안된 raw_df를 이용해 실험해보겠습니다.

In [ ]:
raw_df['Age'].astype(np.int64)

# ValueError: Cannot convert non-finite values (NA or inf) to integer

**3. Salary 컬럼의 타입을 int64로 변경**

In [ ]:
cleaned_df['Salary'] = cleaned_df['Salary'].astype(np.int64)

print(cleaned_df.dtypes)

**4. Purchased 컬럼의 타입을 bool로 변경**

    Purchased 컬럼은 'Yes', 'No'로 이루어진 string 컬럼입니다.
    data type이 object로 되어있는데 bool로 변경하는 것이 좋겠습니다.
    
    pandas Series의 map() method를 통해 'Yes'와 'No'를 각각 True와 False로 변경하겠습니다. (String --> Boolean)

In [ ]:
cleaned_df['Purchased'] = cleaned_df['Purchased'].map({'Yes': True, 'No': False})

display(cleaned_df)